/**
 * Виконай рефакторинг коду задачі використовуючи switch.
 *
 * Якщо до дедлайну 0 днів - виведи рядок "Today"
 * Якщо до дедлайну 1 день - виведи рядок "Tomorrow"
 * Якщо до дедлайну 2 дні - виведи рядок "Overmorrow"
 * Якщо до дедлайну 3+ днів - виведи рядок "Date in the future"
 */

const deadline = 1;
let msg;

switch(deadline) {
    case 0:
        msg = "Today";
        break;
    case 1:
        msg = "Tomorrow";
        break;
    case 2:
        msg = "Overmorrow";
        break;
    default:
        msg = "Date in the future";
}

console.log(msg);




/*
 * Напиши скрипт выбора опції доставки товару.
 * Опция зберігається у змінній option: 1 - самовывоз, 2 - курьер, 3 - пошта
 *
 * У змінну message записати повідомлення залежно від опції.
 * - 'Ви зможете забрати товар завтра з 12:00 у нашому офісі'
 * - 'Курьер доставить замовлення завтра з 9:00 до 18:00'
 * - 'Посилка буде відправленна сьогодні'
 * - 'Вам передзвонить менеджер'
 */


const option = 3;
let message = "";

switch(option) {
    case 1:
        message = 'Ви зможете забрати товар завтра з 12:00 у нашому офісі';
        break;
    case 2:
        message = 'Курьер доставить замовлення завтра з 9:00 до 18:00';
        break;
    case 3:
        message = 'Посилка буде відправленна сьогодні';
        break;
    default:
        message = 'Вам передзвонить менеджер';
}

console.log(message);


/**
 *? Напишіть через свіч пошук автора мови програмування.
 *? Пишемо назву мови у шаблонному рядку отримує відповідь
 *? мова та автор
 *? PHP Расмус Лердорф
 *? C# група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота
 *? Swift Кріс Латтнер
 *? JS Брендан Ейх
 *? Java Джеймс Гослінг
 *? Python Гвідо ван Россум
 */

function findAuthor(author) {
    switch (author) {
        case "C#":
            return "група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота";
        case "PHP":
            return "Расмус Лердорф";
        case "Swift":
            return "Кріс Латтнер";
        case "JS":
            return "Брендан Ейх";
        case "Java":
            return "Джеймс Гослінг";
        case "Python":
            return "Гвідо ван Россум";
        default:
            return "None";
    }
    
}
 console.log(findAuthor("dfd"));