// Функція getLength(array) очікує один 
// параметр array - масив довільних
// значень.Доповни код функції так,
//   щоб вона перетворювала масив у рядок,
//   без роздільників, і повертала кількість
//    символів в отриманому рядку.

function getLength(array) {
  const strArray = array.join("");
  return strArray.length;
}

console.log(getLength(["Mango", "hurries", "to", "the", "train"]));


/**
 * Напиши скрипт для обчислення площі прямокутника зі сторонами,
 * значення яких зберігаються у змінній values у вигляді рядка.
 * Значення гарантовано розділені пробілом.
 */
const values = "8 11";

const arr = values.split(" ");
const result = Number(arr[0]) * Number(arr[1]);

console.log(result);






/**
 * Напиши скрипт для перебору масиву fruits.
 * Для кожного елемента масиву виведи в консоль рядок
 * у форматі номер_елемента: значення_елемента.
 * Нумерація елементів повинна починатися з 1.
 */

const fruits = ["🍎", "🍇", "🍑", "🍌", "🍋"];

for(let i = 0; i < fruits.length; i += 1) {
    console.log(`${i + 1} - ${fruits[i]}`);  
}





// ----------------------------------------- 5

/**
 * Напиши скрипт, який підраховує суму всіх парних чисел у масиві.
 */

const numbers = [1, 5, 8, 9, 12, 4, 15, 27, 30, 18, 14];
let total = 0;

for(const num of numbers) {
    if(!(num % 2)) {
        total += num;
    }
}
